app/controllers/actors_controller.rb

SELECT "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    actor_id = params[:id]
    actor = Actor.find_by(id: actor_id)