app/controllers/movies_controller.rb

  def index
    movie = Movie.all
---
SELECT "movies".* FROM "movies"

  def show
    movie = Movie.find_by(id: params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    movie = Movie.new(
      title: params["title"],
      year: params["year"],
      plot: params["plot"],
    )
    movie.save
---
INSERT INTO "movies" ("title", "year", "plot", "created_at", "updated_at", "director", "english") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    movie_id = params[:id]
    movie = Movie.find_by(id: movie_id)
    movie.title = params["title"] || movie.title
    movie.year = params["year"] || movie.year
    movie.plot = params["plot"] || movie.plot
    movie.save
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "movies" SET "updated_at" = $1, "director" = $2 WHERE "movies"."id" = $3  [["updated_at", "2022-05-12 03:20:25.069609"], ["director", "Action Bronson"], ["id", 6]]

  def destroy
    movie_id = params[:id]
    movie = Movie.find_by(id: movie_id)
    movie.destroy
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = $1  [["id", 1]]